Cashhopers/app/views/admin/hops/show.html.erb

SELECT `hop_tasks`.* FROM `hop_tasks` WHERE `hop_tasks`.`hop_id` = 1
---
<h2>Tasks</h2>
<% @hop.hop_tasks.each do |hop_task| %>

SELECT `hop_ads`.* FROM `hop_ads` WHERE `hop_ads`.`hop_id` = 1
---

<% @hop.hop_ads.each do |hop_ad| %>