Cashhopers/app/views/layouts/_authentication.html.haml

  role:
  - current_user.roles.each do |role|
---
SELECT `roles`.* FROM `roles` INNER JOIN `roles_users` ON `roles`.`id` = `roles_users`.`role_id` WHERE `roles_users`.`user_id` = 12