Cashhopers/app/controllers/admin/hop_tasks_controller.rb

  def show

    @hop_task = HopTask.find(params[:id])
---
SELECT `hop_tasks`.* FROM `hop_tasks` WHERE `hop_tasks`.`id` = 3 LIMIT 1

  def edit
    @hop_task=HopTask.find(params[:id])
---
SELECT `hop_tasks`.* FROM `hop_tasks` WHERE `hop_tasks`.`id` = 1 LIMIT 1

  def create
#    params[:hop_task][:sponsor_id]=current_user.id
    @hop=Hop.find(params["hop_id"])
    @hop_task = HopTask.new(:sponsor_id=>current_user.id, :text_for_hop=>params["text_for_hop"],
                             :hop_task_price=>params["hop_task_price"],
                            # :hop_picture =>params["hop_picture"],
                             :hop_id => params["hop_id"]
    )
    if @hop_task.save
---
SELECT `hops`.* FROM `hops` WHERE `hops`.`id` = 1 LIMIT 1
INSERT INTO `hop_tasks` (`created_at`, `hop_id`, `hop_picture_content_type`, `hop_picture_file_name`, `hop_picture_file_size`, `hop_picture_updated_at`, `hop_task_price`, `sponsor_id`, `text_for_hop`, `updated_at`) VALUES ('2013-07-02 03:28:50', 1, NULL, NULL, NULL, NULL, 'jkhljkh', 12, 'jhgsjkghd', '2013-07-02 03:28:50')

  def update


    @hop_task = HopTask.find(params[:id])

    respond_to do |format|
      if @hop_task.update_attributes(params[:hop_task])
---
SELECT `hop_tasks`.* FROM `hop_tasks` WHERE `hop_tasks`.`id` = 1 LIMIT 1
UPDATE `hop_tasks` SET `text_for_hop` = 'jkhkjkkljkl\r\nfghfg\r\n\r\nfghfgh\r\nfghfgh\r\nfghfgh', `updated_at` = '2013-07-02 05:02:52' WHERE `hop_tasks`.`id` = 1

  def destroy

    @hop_task = HopTask.find(params[:id])
    @hop_task.destroy
---
SELECT `hop_tasks`.* FROM `hop_tasks` WHERE `hop_tasks`.`id` = 1 LIMIT 1
DELETE FROM `hop_tasks` WHERE `hop_tasks`.`id` = 1