Cashhopers/app/controllers/admin/hop_ads_controller.rb

  def show
    @hop_ad = HopAd.find(params[:id])
---
SELECT `hop_ads`.* FROM `hop_ads` WHERE `hop_ads`.`id` = 1 LIMIT 1

  def edit
    @hop_ad = HopAd.find(params[:id])
---
SELECT `hop_ads`.* FROM `hop_ads` WHERE `hop_ads`.`id` = 1 LIMIT 1

  def create
    @hop=Hop.find(params["hop_id"])
   # if(params["hop_picture"])? picture=params["hop_picture"] : picture=''
    @hop_ad = HopAd.new(:sponsor_id=>current_user.id, :ad_name=>params["ad_name"],
                            :contact=>params["contact"],
                            :email=>params["email"],
                            :phone=>params["phone"],
                            :price=>params["price"],
                            :hop_ad_type =>params["hop_ad_type"],
                           # :hop_picture =>picture,
                            :hop_id => params["hop_id"] )

    respond_to do |format|
     if @hop_ad.save
---
SELECT `hops`.* FROM `hops` WHERE `hops`.`id` = 1 LIMIT 1
INSERT INTO `hop_ads` (`ad_name`, `contact`, `created_at`, `email`, `hop_ad_type`, `hop_id`, `phone`, `price`, `sponsor_id`, `updated_at`) VALUES ('', '', '2013-07-02 04:56:34', NULL, 'rolf', 1, '', '', 1, '2013-07-02 04:56:34')

  def update
    @hop_ad = HopAd.find(params[:id])

    respond_to do |format|
      if @hop_ad.update_attributes(params[:hop_ad])
---
SELECT `hop_ads`.* FROM `hop_ads` WHERE `hop_ads`.`id` = 1 LIMIT 1
UPDATE `hop_ads` SET `ad_name` = 'hljkhj', `contact` = 'jkhjh', `email` = 'jkhj', `hop_ad_type` = 'sp', `updated_at` = '2013-07-02 05:00:43' WHERE `hop_ads`.`id` = 1

  def destroy
    @hop_ad = HopAd.find(params[:id])
    @hop_ad.destroy
---
SELECT `hop_ads`.* FROM `hop_ads` WHERE `hop_ads`.`id` = 2 LIMIT 1
DELETE FROM `hop_ads` WHERE `hop_ads`.`id` = 2