Cashhopers/app/controllers/admin/hops_controller.rb

SELECT `hops`.* FROM `hops`
---
  def index
    @hops = Hop.all

SELECT `hops`.* FROM `hops` WHERE `hops`.`id` = 1 LIMIT 1
---
  def show

    @hop = Hop.find(params[:id])

INSERT INTO `hops` (`contact_email`, `contact_phone`, `created_at`, `daily_hop_id`, `hop_close`, `hop_code`, `hop_daily`, `hop_items`, `hop_price`, `jackpot`, `name`, `producer_contact`, `producer_id`, `time_end`, `time_start`, `updated_at`) VALUES ('kjgkj', 'kjgk', '2013-07-02 04:39:15', NULL, 1, 'kjgj', 1, 'jhgk', 'jkhkgjh', 'jgjhg', 'hg', 'kjgkj', 1, 'kjhgk', 'kjhg', '2013-07-02 04:39:15')
---
  def create
    params[:hop][:producer_id]=current_user.id
#    render :text=> params[:hop]
    @hop = Hop.new(params[:hop])

    respond_to do |format|
      if @hop.save